/*Разработать программу для вычисления значения арифметического выражения,
которое может включать в себя вещественные числа, 
а также круглые скобки и следующие операции: +, -, *, /, ^ (возведение в степень). 
Вычисления должны производиться с учетом скобок и приоритетов используемых операций. Предусмотреть 
корректную обработку возможных ошибок при вводе выражения и информирование о них пользователя.*/

#include"Console.h"

void main()
{
	Console::run();
}

//ToDo
/*
	Учесть возможность ввода отрицательных чисел, в т.ч. и в скобках
*/